Revit 2027 API
DefinitionBindingMap Class
A map that contains mappings of parameter definitions to parameter bindings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionBindingMap
 Autodesk.Revit.DB.BindingMap
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DefinitionBindingMap : APIObject,
	IEnumerable
Public Class DefinitionBindingMap
	Inherits APIObject
	Implements IEnumerable
public ref class DefinitionBindingMap : public APIObject,
	IEnumerable
type DefinitionBindingMap =
    class
        inherit APIObject
        interface IEnumerable
    end
The DefinitionBindingMap type exposes the following members.
Constructors
Name | Description
DefinitionBindingMap | Initializes a new instance of the DefinitionBindingMap class
Top
Properties
Name | Description
IsEmpty | Test to see if the map is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Item
Size | Returns the number of bindings that are in the map.
Top
Methods
Name | Description
Clear | Removes every binding from the map, rendering it empty.
Contains
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase
ForwardIterator | Retrieve a forward moving iterator to the map.
GetEnumerator | Retrieve a forward moving iterator to the map.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert
ReverseIterator | Retrieve a backward moving iterator to the map.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace